
#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Rus");
    int a, b;
    cout << "Введите длительность разговора в секундах: ";
    cin >> a;
    cout << " C Билайна на Билайн - 1\n С Билайна на Мтс - 2\n С билайна на Мегафон - 3\n С Мтс на на Мтс - 4\n С мтс на бБилайн - 5\n С Мтс на Мегафон- 6\n С мегафона на Мегафон - 7\n С мегафона на Билайн - 8\n С мегафона на Мтс - 9: ";
    cin >> b;
    if (b < 1 || b > 9) cout << "Ошибка при вводе данных";
    else {
        switch (b) {
        case(1): cout << "Сумма = " << a * 0.67 << " рублей";
            break;
        case(2): cout << "Сумма = " << a * 1 << " рублей";
            break;
        case(3): cout << "Сумма = " << a * 0.59 << " рублей";
            break;
        case(4): cout << "Сумма = " << a * 0.12 << " рублей";
            break;
        case(5): cout << "Сумма = " << a * 0.74 << " рублей";
            break;
        case(6): cout << "Сумма = " << a * 1 << " рублей";
            break;
        case(7): cout << "Сумма = " << a * 0.77 << " рублей";
            break;
        case(8): cout << "Сумма = " << a * 0.98 << " рублей";
            break;
        case(9): cout << "Сумма = " << a * 0.34 << " рублей";

        }

    }

}
